// ФИ: Асанов Илья
//  2. Написать метод подсчета количества цифр числа.

Console.WriteLine("Hello, World!");
